#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+AUTHOR: Sherlhy León López
#+DATE 2019-02-14
#+TODO: TODO BROKEN | DONE

**** tests
     Let's tests the function =filter-for-selection=. 
     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (let* ((list '(1 2 3 4 5 6 7 8 9 10)))
       (format t "Odd numbers greater than 3 and multiple of 3 from~%  ~a:~%  ~a~%"
               list
               (filter-for-selection list 
                                     (list
                                      'is-odd
                                      'greater-than-3
                                      (is-multiple-of 3)))))
     #+END_SRC

     #+RESULTS:
     : Odd numbers greater than 3 and multiple of 3 from
     :   (1 2 3 4 5 6 7 8 9 10):
     :   (9)
*** tests
    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle "../src/vrp-tests.lisp" 
    (dotimes (i 10)
      (print (select-random-element-from '(1 2 3 4 5))))
    #+END_SRC

    #+RESULTS:
    #+begin_example

    4 
    2 
    3 
    3 
    1 
    5 
    2 
    5 
    3 
    4 
    #+end_example
**** no filters, insert anywhere 
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (let* ((c1 (basic-cvrp-client 1 30))
            (c2 (basic-cvrp-client 2 40))
            (c3 (basic-cvrp-client 3 20))
            (c4 (basic-cvrp-client 4 80))
            (r (basic-route :id 1
                            :clients (list c1 c2 c3)
                            :vehicle (basic-vehicle 1)
                            :depot (basic-depot)))

            )
       (insert-client-in-route-with-constraints c4 r nil '(1 2 3 4))
       (format t "route after insertion: ~a~%" (clients r)))
     #+END_SRC

     #+RESULTS:
     : route after insertion: (<c1: 30> <c4: 80> <c2: 40> <c3: 20>)

**** no filters, no candidates 
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (let* ((c1 (basic-cvrp-client 1 30))
            (c2 (basic-cvrp-client 2 40))
            (c3 (basic-cvrp-client 3 20))
            (c4 (basic-cvrp-client 4 80))
            (r (basic-route :id 1
                            :clients (list c1 c2 c3)
                            :vehicle (basic-vehicle 1)
                            :depot (basic-depot))))

       (insert-client-in-route-with-constraints c4 r nil '(0 1 2))
       (format t "route after insertion: ~a~%" (clients r)))
     #+END_SRC

     #+RESULTS:
     : route after insertion: (<c4: 80> <c1: 30> <c2: 40> <c3: 20>)

**** simple test
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (let* ((c1 (basic-cvrp-client 1 30))
            (c2 (basic-cvrp-client 2 40))
            (c3 (basic-cvrp-client 3 20))
            (c4 (basic-cvrp-client 4 80))
            (r (basic-route :id 1
                            :clients (list c1 c2 c3)
                            :vehicle (basic-vehicle 1)
                            :depot (basic-depot)))

            )
       (loop for i from 0 to 5
             doing (format t "element at pos ~a: ~a~%" i
                           (get-element-at-pos i r)))
       (format t "Now with lists.~%")
       (loop for i from 0 to 7
             doing (format t "element at pos ~a: ~a~%" i
                           (get-element-at-pos i '(1 2 3 4 5 6)))))
     #+END_SRC

     #+RESULTS:
     #+begin_example
     element at pos 0: <d:0>
     element at pos 1: <c1: 30>
     element at pos 2: <c2: 40>
     element at pos 3: <c3: 20>
     element at pos 4: <d:0>
     element at pos 5: <d:0>
     Now with lists.
     element at pos 0: 1
     element at pos 1: 2
     element at pos 2: 3
     element at pos 3: 4
     element at pos 4: 5
     element at pos 5: 6
     element at pos 6: NIL
     element at pos 7: NIL
     #+end_example

**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (with-basic-clients (1 2 3 4 5 6)
       (let* ((r0 (basic-route :id 0
                               :vehicle (basic-vehicle 1)
                               :depot (basic-depot)
                               :clients (list c1 c2 c3 c4 c5 c6)))
              (r (clone r0)))
         (bformat t "Testing insert-element-into basic-route")
         (add-element 'a r)
         (format t "Route after insertion:~%~a~%" r)
         (setf r (clone r0))))
     #+END_SRC

     #+RESULTS:
     : =========================================
     :  Testing insert-element-into basic-route
     : =========================================
     : 
     : Route after insertion:
     : <r0: <v:1> (<d:0>: (A <c:1> <c:2> <c:3> <c:4> <c:5> <c:6>))>


** accessing the client's demand
   We can access the demand of a client with the generic-function =demand= as in the following example.

   #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
   (let* ((c1 (basic-cvrp-client 1 50)))
     (format t "Demand of client c1: ~a~%"
             (demand c1)))
   #+END_SRC

   #+RESULTS:
   : Demand of client c1: 50

** accessing the distance between two client's
   This can be done with the function =get-distance-from-to=.  This function receives two clients and a distance-problem.  A distance problem is a problem with the slot distance-matrix.  The following example illustrates the use of this function.

   The class cvrp-problem inherits from distance-problem.

   #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
   (let* ((c1 (basic-cvrp-client 1 30))
          (c2 (basic-cvrp-client 2 40))
          (c3 (basic-cvrp-client 3 20))
          (p1 (cvrp-problem :id 1 :depot (basic-depot)
                            :clients (list c1 c2 c3)
                            :capacity 40
                            :distance-matrix #2A((0 1 2 3)
                                                 (1 0 4 6)
                                                 (2 4 0 2)
                                                 (3 6 2 0)))))
     (format t "distance from c1 to c2: ~a~%"
             (get-distance-from-to c1 c2 p1)))
   #+END_SRC

   #+RESULTS:
   : distance from c1 to c2: 4
** accessing the clients in a problem
   We can get the list with clients in a basic-problem with the generic function =clients=.

   The class cvrp-problem inherits from basic-problem.

   #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
   (let* ((c1 (basic-cvrp-client 1 30))
          (c2 (basic-cvrp-client 2 40))
          (c3 (basic-cvrp-client 3 20))
          (p1 (cvrp-problem :id 1 :depot (basic-depot)
                            :clients (list c1 c2 c3)
                            :capacity 40
                            :distance-matrix #2A((0 1 2 3)
                                                 (1 0 4 6)
                                                 (2 4 0 2)
                                                 (3 6 2 0)))))
     (format t "clients in p1: ~a~%"
             (clients p1)))
   #+END_SRC

   #+RESULTS:
   : clients in p1: (<c1: 30> <c2: 40> <c3: 20>)
** accessing the capacity of the vehicles in a cvrp
   We can get the capacity of the vehicles in an homogeneous fleet cvrp with the the generic function capacity.  The cvrp with homogeneous fleet is modelled with the class cvrp-problem.

   The class cvrp-problem inherits from basic-problem.

   #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
   (let* ((c1 (basic-cvrp-client 1 30))
          (c2 (basic-cvrp-client 2 40))
          (c3 (basic-cvrp-client 3 20))
          (p1 (cvrp-problem :id 1 :depot (basic-depot)
                            :clients (list c1 c2 c3)
                            :capacity 40
                            :distance-matrix #2A((0 1 2 3)
                                                 (1 0 4 6)
                                                 (2 4 0 2)
                                                 (3 6 2 0)))))
     (format t "capacity of vehicles in p1: ~a~%"
             (capacity p1)))
   #+END_SRC

   #+RESULTS:
   : capacity of vehicles in p1: 40
*** tests

    First let's create a filter for the demand:

    #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-initial-routes.lisp
     (make-filter-for-selection with-demand-smaller-or-equal-to (n)
                              (<= (demand element) n))
    #+END_SRC

    and now, let's test the selection:
    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (progn

     (let* ((c1 (basic-cvrp-client 1 30))
            (c2 (basic-cvrp-client 2 40))
            (c3 (basic-cvrp-client 3 20))
            (unassigned-clients (list c1 c2 c3))
            (d 45)
            ;; (p1 (cvrp-problem :id 1 :depot (basic-depot)
            ;;                   :clients (list c1 c2 c3)
            ;;                   :capacity 40
            ;;                   :distance-matrix #2A((0 1 2 3)
            ;;                                        (1 0 4 6)
            ;;                                        (2 4 0 2)
            ;;                                        (3 6 2 0))))
            )
       (format t "Selecting from ~a with demand <= ~a~%~a~%"
               unassigned-clients d
               (select-random-element-from
                  (filter-for-selection
                   unassigned-clients
                   (list (funcall f1 t)))))))
    #+END_SRC

    #+RESULTS:
    : Selecting from (<c1: 30> <c2: 40> <c3: 20>) with demand <= 45
    : <c2: 40>
   
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (let* ((c1 (basic-cvrp-client 1 30))
             (c2 (basic-cvrp-client 2 40))
             (c3 (basic-cvrp-client 3 20))
             (r (basic-route :vehicle (basic-vehicle 1)
                             :depot (basic-depot)
                             :clients (list c1 c3 c2))))
        (bformat t "Testing remove-client")

        (remove-client c3 r)
        (format t "route after removing c3: ~a~%"
                (clients r)))
     #+END_SRC

     #+RESULTS:
     : =======================
     :  Testing remove-client
     : =======================
     : 
     : route after removing c3: (<c1: 30> <c2: 40>)
*** tests
    Let's test it:

    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (format t "empty-route for cvrp:~% ~a~%"
            (make-empty-route-for-problem a-n65-k9-problem))
    #+END_SRC

    #+RESULTS:
    : empty-route for cvrp:
    :  <r1: <cv:1. 0/100> (<d:0>: NIL)>



** creating a problem instance
   #+BEGIN_SRC lisp +n -r :results output :exports both
   (defparameter dafne-problem-1
     (let* ( ;;{{{ let's define the products
            (p1 (basic-product 1 "Gasolina especial"))
            (p2 (basic-product 2 "Gasolina regular"))
            (p3 (basic-product 3 "Petroleo"))
            ;;}}}
            ;;{{{ now the clients
            (c1 (basic-cupet-client 1 (list p1 p2 p3)))
            (c2 (basic-cupet-client 2 (list p1)))
            (c3 (basic-cupet-client 3 (list p1 p2)))
            (c4 (basic-cupet-client 4 (list p1)))
            (c5 (basic-cupet-client 5 (list p1 p3)))
            (c6 (basic-cupet-client 6 (list p1)))
            (c7 (basic-cupet-client 7 (list p1)))
            ;;}}}


            ;;{{{ next, the vehicles
            (v1 (basic-cupet-vehicle 1 2
                                     :compatible-clients
                                     (list c1 c2 c3 c4 c5)
                                     :products
                                     (list p1)))
            (v2 (basic-cupet-vehicle 2 2
                                     :compatible-clients
                                     (list c3 c4 c5 c6 c7)
                                     :products
                                     (list p1)))
            (v3 (basic-cupet-vehicle 3 3
                                     :compatible-clients
                                     (list c4)
                                     :products
                                     (list p1 p2 p3)))
            (v4 (basic-cupet-vehicle 4 3
                                     :compatible-clients
                                     (list c1 c2 c3 c4)
                                     :products
                                     (list p1 p2 p3)))
            ;;}}}
            ;;{{{ here comes the distance matrix
            (distance-matrix #2A((  0  3 12  5  7  8 10  4)
                                 (  3  0  2  4  6  6  4  2)
                                 ( 12  2  0  2  4  6  6  4)
                                 (  5  4  2  0  2  4  6  6)
                                 (  7  6  4  2  0  2  4  6)
                                 (  8  6  6  4  2  0  2  4)
                                 ( 10  4  6  6  4  2  0  2)
                                 (  4  2  4  6  6  4  2  0)))
            ;;}}}
            ;;{{{ and finally, here we create an instance of
            ;; a bosic problem
            (problem1 (cupet-problem  
                       :id 1
                       :clients (list c1 c2 c3 c4 c5 c6 c7)
                       :depot (basic-depot)
                       :products (list p1 p2 p3)
                       :vehicles (list v1 v2 v3 v4)
                       :distance-matrix distance-matrix))
            ;;}}}
            )

       (format t "products in c1 *in vehicle*: ~a~%" (products (first (compatible-clients v1))))
         

       ;;{{{ let's set the demand for each product and clients
       (setf (product-demand p1 c1) 20)
       (setf (product-demand p2 c1) 20)
       (setf (product-demand p3 c1) 40)
       (setf (product-demand p1 c2) 15)
       (setf (product-demand p1 c3) 11)
       (setf (product-demand p2 c3) 20)
       (setf (product-demand p1 c4) 25)
       (setf (product-demand p1 c5) 22)
       (setf (product-demand p3 c5) 18)
       (setf (product-demand p1 c6) 17)
       (setf (product-demand p1 c7) 21)
       ;;}}}

       ;;{{{ let's set the compartment capacity for each vehicle
       ;; v1 ;;
       (set-compartment-capacity p1 v1 45)
       (set-compartment-capacity p3 v1 30)
       ;; v2 ;;
       (set-compartment-capacity p1 v2 40)
       (set-compartment-capacity p2 v2 35)
       ;; v3 ;;
       (set-compartment-capacity p1 v3 400)
       (set-compartment-capacity p2 v3 190)
       (set-compartment-capacity p3 v3 350)
       ;; v4 ;;
       (set-compartment-capacity p1 v4 100)
       (set-compartment-capacity p2 v4 190)
       (set-compartment-capacity p3 v4 150)
       ;;}}}

       ;; (bformat t "Testing the creation of a cupet-problem")

       ;; (check-= 20 (product-demand p1 c1))
       ;; (check-nil  (product-demand p2 c1))

       ;; (loop for v in (list v1 v2 v3 v4)
       ;;       do (format t "products of v~a: ~a~%"
       ;;                  (id v)
       ;;                  (products v)))

       (format t "clients: ~a~%" (clients problem1))


       (format t "products in c1 [at the end]: ~a~%" (products c1))

       (format t "products in c1 *in vehicle* END: ~a~%" (products (first (compatible-clients v1))))

       ;; let's return the problem
       problem1

       ))
       #+END_SRC

       #+RESULTS:
       #+begin_example
       =========================================
        Testing the creation of a cupet-problem
       =========================================

          pass ... Check 20:         (PRODUCT-DEMAND P1 C1)
          pass ... Check NIL:        (PRODUCT-DEMAND P2 C1)
       products of v1: (<p1: Gasolina especial>)
       products of v2: (<p1: Gasolina especial>)
       products of v3: (<p1: Gasolina especial> <p2: Gasolina regular> <p3: Petroleo>)
       products of v4: (<p1: Gasolina especial> <p2: Gasolina regular> <p3: Petroleo>)
       clients: (<cupet c1> <cupet c2> <cupet c3> <cupet c4> <cupet c5> <cupet c6>
                 <cupet c7>)
       #+end_example

**** basic test
     Let's test it:

     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (format t "empty-route for cupet problem:~% ~a~%"
             (make-empty-route-for-problem dafne-problem-1))
     #+END_SRC

     #+RESULTS:
     : empty-route for cupet problem:
     :  <r1: NIL (<d:0>: NIL)>
**** testing empty route with vehicle
     Let's test it:

     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (format t "empty-route for cupet problem:~% ~a~%"
             (make-empty-route dafne-problem-1 dv1))
     #+END_SRC

     #+RESULTS:
     : empty-route for cupet problem:
     :  <r1: <cupet_v1: 2> (<d:0>: (<cupet c1>))>


   


**** let's test it minimizing-distance with a small problem
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
     (let* ((c1 (basic-cvrp-client 1 30))
            (c2 (basic-cvrp-client 2 40))
            (c3 (basic-cvrp-client 3 20))
            (problem-capacity 60)
            (p1 (cvrp-problem :id 1 :depot (basic-depot)
                              :clients (list c1 c2 c3)
                              :capacity problem-capacity
                              :distance-matrix #2A(( 0 10  20  3)
                                                   (10  0  4  6)
                                                   (20  4  0  2)
                                                   ( 3  6  2  0))))
            )
       (format t "feasible route: ~a~%"
               (clients (generate-route2 p1))))
     #+END_SRC

     #+RESULTS:
     : feasible route: (<c3: 20> <c1: 30>)

*** let's test generate-route2 minimizing-distance with a small problem
    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (let* ((c1 (basic-cvrp-client 1 30))
           (c2 (basic-cvrp-client 2 40))
           (c3 (basic-cvrp-client 3 20))
           (problem-capacity 60)
           (p1 (cvrp-problem :id 1 :depot (basic-depot)
                             :clients (list c1 c2 c3)
                             :capacity problem-capacity
                             :distance-matrix #2A(( 0 10  20  3)
                                                  (10  0  4  6)
                                                  (20  4  0  2)
                                                  ( 3  6  2  0))))
           )
      (format t "feasible route: ~a~%"
              (clients (generate-route2 p1))))
    #+END_SRC

    #+RESULTS:
    : feasible route: (<c3: 20> <c1: 30>)

